lzyiii404/MyWorkSpace/STM32/Learn/F103/USART/src/bsp_usart.h
#ifndef  __BSP_USART_H
#define  __BSP_USART_H

#include "stm32f10x.h"
#include "stm32f10x_usart.h"
#include <stdio.h>

#define   DEBUG_USARTx                  USART1
#define   DEBUG_USART_CLK               RCC_APB2Periph_USART1
#define   DEBUG_USART_APBxClkCmd        RCC_APB2PeriphClockCmd
#define   DEBUG_USART_BAUDRATE          115200

#define   DEBUG_USART_GPIO_CLK          RCC_APB2Periph_GPIOA
#define   DEBUG_USART_GPIO_APBxClkCmd   RCC_APB2PeriphClockCmd

#define   DEBUG_USART_TX_GPIO_PORT      GPIOA
#define   DEBUG_USART_TX_GPIO_PIN       GPIO_Pin_9
#define   DEBUG_USART_RX_GPIO_PORT      GPIOA
#define   DEBUG_USART_RX_GPIO_PIN       GPIO_Pin_10

#define   DEBUG_USART_IRQ               USART1_IRQn
#define   DEBUG_USART_IRQHandler        USART1_IRQHandler

void USART_Config(void);
void USART_SendByte(USART_TypeDef*  pUSARTx, u8 data);
void USART_SendHalfWord(USART_TypeDef*  pUSARTx, u16 data);
void USART_SendSentence(USART_TypeDef*  pUSARTx, char* str);

#endif   /*__BSP_USART_H*/
